tutorials/cases/biomassPressureDrop/p08/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           off;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

chemistrySolver     ode;

solidChemistrySolver	solidOde;

initialChemicalTimeStep 1e-07;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;
solidChemistryTimeStepControl true;

odeCoeffs
{
    solver          seulex;
}

solidOdeCoeffs
{
    solver      seulex;
}

species
(
   air 
);

solidReactions
(
);


// ************************************************************************* //


