tutorials/cases/biomassPressureDrop/p08/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<constHeterogeneous>;

solidComponents
(
  char 
);

charCoeffs
{
    transport
    {
        K           0.156; // (0.071+0.105+0.105)/3./.6  Park2010, Asako2002
    }
    thermodynamics
    {
        Cp          1054; // Park2010 for T=300
        Hf          -2.12e4;
    }
    density
    {
        rho           1050;
    }
};

// ************************************************************************* //

